HatemAlamir90/embedded_systems/UsingSAM3N/using_sam3n.c
#include "sam3n.h"
#include "using_sam3n.h"
#include "cmsis_os.h"
void device_init(void)
{
	REG_PIOA_PER = 0xFFFFFF78;
	REG_PIOA_PDR = 0x00000087;
	REG_PIOA_OER = 0x00000087;
	REG_PIOA_ODR = 0xFFFFFF78;
	REG_PIOA_IFER = 0x00000000;
	REG_PIOA_IFDR = 0xFFFFFFFF;
	REG_PIOA_IFSCDR = 0x00000000;
	REG_PIOA_IFSCER = 0xFFFFFFFF;
	REG_PIOA_SODR = 0x00000000;
	REG_PIOA_CODR = 0xFFFFFFFF;
	REG_PIOA_OWER = 0x00000000;
	REG_PIOA_OWDR = 0xFFFFFFFF;
	REG_PIOA_IER = 0x00000000;
	REG_PIOA_IDR = 0xFFFFFFFF;
	REG_PIOA_MDER = 0x00000000;
	REG_PIOA_MDDR = 0xFFFFFFFF;
	REG_PIOA_PUER = 0x00000000;
	REG_PIOA_PUDR = 0xFFFFFFFF;
	REG_PIOA_PPDDR = 0xFFFFFFF8;
	REG_PIOA_PPDER = 0x00000007;
	REG_PIOA_ABCDSR = 0x00000080;
	REG_PIOA_AIMER = 0x00000000;
	REG_PIOA_AIMDR = 0xFFFFFFFF;
	
	REG_PWM_MR = 0x00000000;
	REG_PWM_ENA = 0x0000000F;
	REG_PWM_DIS = 0x00000000;
	REG_PWM_IER = 0x00000000;
	REG_PWM_IDR = 0x0000000F;
	REG_PWM_CMR0 = 0x0000020A;
	REG_PWM_CDTY0 = 0x0000000F;
	REG_PWM_CPRD0 = 0x000000FF;
	REG_PWM_CMR1 = 0x0000020A;
	REG_PWM_CDTY1 = 0x0000000F;
	REG_PWM_CPRD1 = 0x000000FF;
	REG_PWM_CMR2 = 0x0000020A;
	REG_PWM_CDTY2 = 0x0000000F;
	REG_PWM_CPRD2 = 0x000000FF;
	REG_PWM_CMR3 = 0x0000020A;
	REG_PWM_CDTY3 = 0x0000000F;
	REG_PWM_CPRD3 = 0x000000FF;
}
void scan(void const *arg)
{
	while(1);
}
osThreadDef(scan, osPriorityNormal, 1, 0);
void begin(void)
{
	osThreadCreate(osThread(scan), NULL);
}

